Catalogs/КонтрактыИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КонтрактыИсполнителей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.ГосударственныеКонтракты</xr:Item>
				<xr:Item>Catalog.КонтрактыСЗаказчиками</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКонтрактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрактСУчастникомГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеКонтракты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежаФЗ275</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПлатежейФЗ275</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежиПо275ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОпределенияПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеОплатПоБанковскимСчетам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗаявокПоБанковскимСчетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОплатыЗаСчетСобственныхСредств</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВУтвержденномПеречнеИностранныхИсполнителейГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДобавленияПоследнегоДопСоглашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыКонтрактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГосударственныйКонтракт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГосударственныеКонтракты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НомераКонтрактов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтрактСЗаказчиком</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтрактыСЗаказчиками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РаспределениеЗаявокПоБанковскимСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>РаспределениеЗаявокПоБанковскимСчетам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоУказаннымКонтрактам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВсемКонтрактам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияКонтрактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>СостоянияКонтрактов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыПлатежейФЗ275.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ТипыПлатежейФЗ275</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеПунктаЗакона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПунктаЗакона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеТребуютсяДокументыПодтвержденияИсполненияКонтракта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КонтрактыИсполнителей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не КонтрактСУчастникомГОЗ Тогда
		НомераКонтрактов.Очистить();
		ГосударственныйКонтракт = Неопределено;
	КонецЕсли;
	
	ОбщегоНазначения275КлиентСервер.ПроверитьДоговор(Ссылка, Договор, Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком, "исполнителем", Отказ);
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("НеПроверятьОбщиеРеквизиты") Тогда
		Если ЗначениеЗаполнено(Договор) Тогда
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "Владелец,Организация");
			
			// Контракт с исполнителем (договор с поставщиком)
			Если Реквизиты.Организация <> Организация Тогда
				ТекстОшибки = СтрШаблон("%1 в договоре не совпадает с %2 в контракте", "Организация", "заказчиком");
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
			КонецЕсли;
			Если Реквизиты.Владелец <> Владелец Тогда
				ТекстОшибки = СтрШаблон("%1 в договоре не совпадает с %2 в контракте", "Контрагент", "исполнителем");
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если КонтрактСУчастникомГОЗ Тогда
		Если Не НомераКонтрактов.Количество() Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru = 'Не указаны сведения о кооперации'"), Отказ);
		КонецЕсли;
		ПроверяемыеРеквизиты.Добавить("ГосударственныйКонтракт");
	КонецЕсли;
	
	Если Не ПлатежиПо275ФЗ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("БанковскийСчетКонтрагента");
		МассивНепроверяемыхРеквизитов.Добавить("ТипПлатежаФЗ275");
	КонецЕсли;
	
	Если РаспределениеОплатПоБанковскимСчетам = Перечисления.РаспределениеЗаявокПоБанковскимСчетам.ПоУказаннымКонтрактам Тогда
		Если НомераКонтрактов.Итог("Процент") <> 100 Тогда
			ОбщегоНазначения.СообщитьОбОшибке(
				НСтр("ru = 'Распределение оплаты по контрактам должно быть 100%'"), Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если СуммаКонтракта < Справочники.ЭтапыКонтрактов.СуммаЭтаповКонтракта(Ссылка) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(
			НСтр("ru = 'Сумма графика платежей превышает сумму контракта'"), Отказ);
	КонецЕсли;
	
	Если ПлатежиПо275ФЗ Тогда
		Контроли275Сервер.ОбработкаПроверкиЗаполненияПодтверждающиеДокументы(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
		ПроверяемыеРеквизиты,
		МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ДанныеЗаполненияТип = ТипЗнч(ДанныеЗаполнения);
	
	Если ДанныеЗаполненияТип = Тип("СправочникСсылка.ГосударственныеКонтракты") Тогда
		
		ОбработкаЗаполненияГосударственныеКонтракты(ДанныеЗаполнения);
		
	ИначеЕсли ДанныеЗаполненияТип = Тип("СправочникСсылка.КонтрактыСЗаказчиками") Тогда
		
		ОбработкаЗаполненияКонтрактыСЗаказчиками(ДанныеЗаполнения);
		
	ИначеЕсли ДанныеЗаполненияТип = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		ОбработкаЗаполненияДоговорыКонтрагентов(ДанныеЗаполнения);
		
	ИначеЕсли ДанныеЗаполненияТип = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
	ИнициализироватьСправочник();
	
КонецПроцедуры

Процедура ОбработкаЗаполненияГосударственныеКонтракты(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеЗаполнения.Ссылка КАК ГосударственныйКонтракт,
	|	ИСТИНА КАК КонтрактСУчастникомГОЗ
	|ИЗ
	|	Справочник.ГосударственныеКонтракты КАК ДанныеЗаполнения
	|ГДЕ
	|	ДанныеЗаполнения.Ссылка = &ДанныеЗаполнения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
КонецПроцедуры

Процедура ОбработкаЗаполненияКонтрактыСЗаказчиками(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеЗаполнения.Ссылка КАК Основание,
	|	ДанныеЗаполнения.Владелец КАК Организация,
	|	ДанныеЗаполнения.Контрагент КАК Владелец,
	|	ДанныеЗаполнения.КонтрактСУчастникомГОЗ КАК КонтрактСУчастникомГОЗ,
	|	ДанныеЗаполнения.ГосударственныйКонтракт КАК ГосударственныйКонтракт,
	|	100 КАК Процент
	|ИЗ
	|	Справочник.КонтрактыСЗаказчиками КАК ДанныеЗаполнения
	|ГДЕ
	|	ДанныеЗаполнения.Ссылка = &ДанныеЗаполнения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
КонецПроцедуры

Процедура ОбработкаЗаполненияДоговорыКонтрагентов(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеЗаполнения.Ссылка КАК Договор,
	|	ИСТИНА КАК КонтрактСУчастникомГОЗ,
	|	ДанныеЗаполнения.Владелец КАК Владелец,
	|	ДанныеЗаполнения.Организация КАК Организация,
	|	ДанныеЗаполнения.Дата,
	|	ДанныеЗаполнения.Номер
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДанныеЗаполнения
	|ГДЕ
	|	ДанныеЗаполнения.Ссылка = &ДанныеЗаполнения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, , "Дата,Номер");
	Если Не ЗначениеЗаполнено(Дата) Тогда
		ЭтотОбъект.Дата = Выборка.Дата;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Номер) Тогда
		ЭтотОбъект.Номер = Выборка.Номер;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьСправочник()
	
	Если Ответственный.Пустая() Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	Если Состояние.Пустая() Тогда
		Состояние = Перечисления.СостоянияКонтрактов.Готовится;
	КонецЕсли;
	
	Если Организация.Пустая() Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Ответственный, "ОсновнаяОрганизация");
	КонецЕсли;
	Если Владелец.Пустая() Тогда
		Владелец = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Ответственный, "ОсновнойПоставщик");
	КонецЕсли;
	
	Если ПодтверждающиеДокументы.Количество() = 0 Тогда
		Если ТипПлатежаФЗ275.Пустая() Тогда
			ВидыДокументов = Справочники.ТипыПлатежейФЗ275.ПодтверждающиеВидыДокументов(ОбщегоНазначения275Сервер.ТипПлатежа275ФЗДляКонтрактаИсполнителяПоУмолчанию());
		Иначе
			ВидыДокументов = Справочники.ТипыПлатежейФЗ275.ПодтверждающиеВидыДокументов(ТипПлатежаФЗ275);
		КонецЕсли;
		Для Каждого ВидДокумента Из ВидыДокументов Цикл 
			НоваяСтрока = ПодтверждающиеДокументы.Добавить();
			НоваяСтрока.ВидДокумента = ВидДокумента;
			Если КонтрактСУчастникомГОЗ Тогда
				НоваяСтрока.ГосударственныйКонтракт = ГосударственныйКонтракт;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
